Repository: moridaffy/censor-ios
Catalog: censor/Resources/*.lproj/Localizable.strings
Languages: ru

# root.welcome.title
source: Welcome to CenStory
ru: Добро пожаловать в CenStory

# root.welcome.description
source: Tap on one of the buttons bellow to continue
ru: Нажмите на одну из кнопок ниже для продолжения

# root.button.create
source: Create new project
ru: Создать новый проект

# root.button.browse
source: Browse existing projects
ru: Мои проекты

# projects.title
source: Projects
ru: Проекты

# projects.project
source: Project
ru: Проект

# projects.new_project
source: New project
ru: Новый проект

# projects.new_project_name
source: Enter new project's name
ru: Введите название проекта

# editor.export
source: Export
ru: Экспорт

# editor.select.audio_mode
source: Select audio mode
ru: Выбрать режим наложения

# editor.select.sound
source: Select sound
ru: Выбрать звук

# editor.render.done
source: Video has been successfully rendered and saved to photo library
ru: Видео было успешно экспортировано

# editor.sound_mode.mute.title
source: Mute original
ru: Заглушить оригинал

# editor.sound_mode.mute.description
source: Completely mute original audio track while overlaying it with added sound
ru: Полностью заглушить оригинальное аудио во время наложения звука

# editor.sound_mode.silence.title
source: Silence original
ru: Приглушить оригинал

# editor.sound_mode.silence.description
source: Keep only 20% of original track's volume while overlaying it with added sound
ru: Оставить только 20% громкости оригинального аудио на время наложения звука

# editor.sound_mode.original.title
source: Keep original
ru: Оставить оригинал

# editor.sound_mode.original.description
source: Don't change original audio track volume
ru: Не изменять оригинальное аудио

# settings.title
source: Settings
ru: Настройки

# settings.icon.title
source: Select app icon
ru: Выбрать иконку

# settings.tip.title
source: Leave a tip
ru: Оставить чаевые

# settings.tip.description
source: Developing and supporting mobile apps take a lot of time and effort. I decided to make this app free so everyone can try it out and decide whether to keep it on his phone or delete it. If you enjoy using this app, you can say thanks and motivate me to work even harder on it by simply leaving a tip. You can even choose the amount of tip you want to give and give it as many times as you wish :) By leaving any tip, you support me and get access to some new features: • all ads magically will dissapear, as well as watermark on your exported videos • additional sounds will become unlocked • some new features may also appear
ru: Разработка и поддержка мобильных приложений требуют много времени и усилий. Я решил сделать это приложение бесплатным, чтобы каждый мог попробовать его и решить, оставить ли его на своем телефоне или удалить. Если вам нравится использовать это приложение, вы можете поблагодарить и мотивировать меня работать над ним еще усерднее, просто оставив чаевые. Вы даже можете выбрать размер чаевых, которые хотите дать, и давать их столько раз, сколько хотите :) Оставляя чаевые, вы поддерживаете меня и получаете доступ к некоторым новым функциям: • вся реклама волшебным образом исчезнет из приложения, как и водяной знак на ваших экспортированных видео • будут разблокированы дополнительные звуки • также могут появиться некоторые новые функции

# settings.tip.small.title
source: Small tip
ru: Малые чаевые

# settings.tip.medium.title
source: Medium tip
ru: Средние чаевые

# settings.tip.large.title
source: Large tip
ru: Большие чаевые

# settings.iap.purchase_restore_button
source: Restore purchases
ru: Восстановить покупки

# settings.iap.purchase_restored
source: Your previous purchases has been restored
ru: Ваши предыдущие покупки были восстановлены

# settings.iap.purchase_completed_title
source: Thank you
ru: Спасибо

# settings.iap.purchase_completed_description
source: Purchase has been successfully completed and all premium features have been unlocked
ru: Покупка успешно совершена, полный функционал был разблокирован

# settings.debug.already_unlocked
source: Premium features are already unlocked
ru: Полный функционал уже разблокирован

# settings.debug.unlocked
source: Premium features have been unlocked. Please, restart application for changes to take effect
ru: Полный функционал был разблокирован. Перезапустите приложение, чтобы изменения вступили в силу

# settings.debug.unlock_button
source: Activate premium features
ru: Активировать полный функционал

# settings.debug.already_locked
source: Premium features are already locked
ru: Полный функционал уже заблокирован

# settings.debug.locked
source: Premium features have been locked. Please, restart application for changes to take effect
ru: Полный функционал был заблокирован. Перезапустите приложение, чтобы изменения вступили в силу

# settings.debug.lock_button
source: Deactivate premium features
ru: Заблокировать полный функционал

# settings.debug.projects_deleted
source: All project data has been deleted. Please, restart application for changes to take effect
ru: Все проекты удалены. Перезапустите приложение, чтобы изменения вступили в силу

# settings.debug.projects_delete_button
source: Wipe projects
ru: Удалить проекты

# common.done
source: Done
ru: Готово

# common.ok
source: OK
ru: ОК

# common.cancel
source: Cancel
ru: Отмена

# common.save
source: Save
ru: Сохранить

# common.create
source: Create
ru: Создать

# common.delete
source: Delete
ru: Удалить

# common.search
source: Search
ru: Поиск

# hint.editor.preview
source: This is the preview of your video
ru: Это предпросмотр вашего видео

# hint.editor.add_sound
source: Tap this button to add sound at current position of the video
ru: Нажмите эту кнопку, чтобы добавить звук на текущую позицию в видео

# hint.editor.timeline
source: Here you can see the whole video timeline, it's current position and all added sounds
ru: Это полная лента видео, текущая позиция и все добавленные звуки

# hint.editor.added_sound
source: This is how added sound looks like. Tap it to remove it from timeline
ru: Вот так добавленный звук выглядит на ленте видео. Нажмите на него, чтобы удалить

# hint.editor.play_pause
source: Tap this button to play/pause your video
ru: Нажмите эту кнопку, чтобы воспроизвести/остановить видео

# hint.editor.audio_mode
source: Tap this button to select audio mode used in final video rendering
ru: Нажмите эту кнопку, чтобы выбрать режим наложения звука, используемый при экспорте видео

# hint.editor.all_sounds
source: Tap this button to browse through all available sounds
ru: Нажмите эту кнопку, чтобы просмотреть полный список всех доступных звуков

# hint.editor.export
source: Tap this button to start rendering and exporting your edited project
ru: Нажмите эту кнопку, чтобы экспортировать видео

# hint.editor.help
source: Tap this button to go through tutorial once again
ru: Нажмите эту кнопку, чтобы запустить обучение еще раз

# error.error
source: Error
ru: Ошибка

# error.unknown_error_occured
source: Unknown error occurred
ru: Произошла неизвестная ошибка

# error.empty_file_url
source: File's url is empty for some reason
ru: URL файла почему-то пустой :/

# error.unable_to_play_video
source: Unable to play video
ru: Не удалось воспроизвести видео

# error.unable_to_render_video
source: Unable to render video
ru: Не удалось экспортировать видео

# error.unable_to_restore_purchase
source: Unable to restore in-app purchase
ru: Не удалось восстановить покупку

# error.unable_to_make_purchase
source: Unable to make in-app purchase
ru: Не удалось совершить покупку

# error.unable_to_connect_to_app_store
source: Unable to connect to App Store
ru: Не удалось соединиться с App Store

# error.unable_to_verify_purchase
source: Unable to verify purchase in App Store
ru: Не удалось подтвердить покупку в App Store

# error.iap_not_allowed
source: This device can't be used for in-app purchases
ru: Это устройство не может быть использовано для встроенных покупок

# error.iap_cancelled
source: Purchase cancelled
ru: Покупка отменена
